//******************************************************************************
#include "mydef.h"					// Об'явление удобных типов
//------------------------------------------------------------------------------
#include "Error/Error.h"			// Работа с ошибками
//==============================================================================
#include "res/resource.h"			// Идентификаторы ресурсов
#include "res/errs.h"				// Идентификаторы сообщений
//------------------------------------------------------------------------------
#include "Srvc/Runner.h"			// Запускальщик программы
#include "Srvc/Service.h"			// Сервис
//------------------------------------------------------------------------------
#include "Interface/MainWnd.h"		// Главное окно интерфейса
#include "Interface/CmdLine.h"		// Разбор коммандной строки
#include "SCfgP/SCfgP.h"			// Service Configuration Program
#include "SCtrlP/SCtrlP.h"			// Service Control Program
//==============================================================================
#include "main.h"					// Об'явление глобальных переменных
#include "Utils/Utils.h"			// Some shared funcs
//******************************************************************************
